In [1]:
import numpy as np
import pandas as pd
import matplotlib as mp
import math
import random
import statsmodels
from pandas_datareader import data as wb

## Trading Data Source
https://pandas-datareader.readthedocs.io/en/latest/remote_data.html#remote-data-iex

### Source: Yahoo

In [3]:
# importing data
tickers = ['PG', 'MSFT','T','F','GE']
df_tickers = pd.DataFrame()
for t in tickers:
    df_tickers[t] = wb.DataReader(t, data_source='yahoo', start = '1995-1-1')['Adj Close']

df_tickers.head(5)

                  PG      MSFT         T         F        GE
Date
1995-01-03  8.114557  2.383754  5.984757  4.380183  4.119593
1995-01-04  8.049510  2.401081  5.950541  4.498034  4.119593
1995-01-05  7.935676  2.361476  6.043519  4.458752  4.129690
1995-01-06  7.951943  2.401081  6.043519  4.458752  4.109495
1995-01-09  7.919417  2.386229  6.024921  4.537320  4.069108

In [4]:
df_tickers.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6659 entries, 1995-01-03 to 2021-06-14
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   PG      6659 non-null   float64
 1   MSFT    6659 non-null   float64
 2   T       6659 non-null   float64
 3   F       6659 non-null   float64
 4   GE      6659 non-null   float64
dtypes: float64(5)
memory usage: 312.1 KB

In [7]:
df_tickers.size

33295

### Source: Quandl

In [18]:
import quandl

In [20]:
df_data = quandl.get("FRED/GDP")
df_data.head(3)

              Value
Date
1947-01-01  243.164
1947-04-01  245.968
1947-07-01  249.585

In [21]:
# Storing data to csv
df_data.to_csv("/Users/anindraiswara/JupyterProjects/python-for-finance/df_data_quandl_01.csv")

In [22]:
df_data_csv = pd.read_csv("/Users/anindraiswara/JupyterProjects/python-for-finance/df_data_quandl_01.csv")
df_data_csv.head(3)

         Date    Value
0  1947-01-01  243.164
1  1947-04-01  245.968
2  1947-07-01  249.585

## Converting Data into Timeseries

In [26]:
df_data_csv.set_index("Date", inplace= True)
df_data_csv.head(3)

              Value
Date
1947-01-01  243.164
1947-04-01  245.968
1947-07-01  249.585